import { Definitions } from './type';

/**
 * 祝日・休業日定義
 * 1948年（昭和23年）7月20日施行以降の祝日定義
 * https://ja.wikipedia.org/wiki/国民の祝日
 *
 * 祝日・休業日タイプ： 1: 日付指定
 *      [1, '祝日・休業日名', 月, 日, 開始年, [終了年]]
 * 祝日・休業日タイプ： 2: 週曜日指定（日:0〜土:6）
 *      [2, '祝日・休業日名', 月, [週, 曜日], 開始年, [終了年]]
 * 祝日タイプ： 3:春分の日
 *      [3, '祝日名']
 * 祝日タイプ： 4:秋分の日
 *      [4, '祝日名']
 * 祝日・休業日タイプ： 9: 年月日指定
 *      [9, '祝日・休業日名', ['YYYY/MM/DD']]
 */
const definitions: Definitions = [
  [1, '元日', 1, 1, 1949],
  [1, '成人の日', 1, 15, 1949, 1999],
  [2, '成人の日', 1, [2, 1], 2000],
  [1, '建国記念の日', 2, 11, 1967],
  [1, '天皇誕生日', 2, 23, 2020],
  [1, '昭和天皇の大喪の礼', 2, 24, 1989, 1989],
  [3, '春分の日'],
  [1, '皇太子明仁親王の結婚の儀', 4, 10, 1959, 1959],
  [1, '天皇誕生日', 4, 29, 1949, 1988],
  [1, 'みどりの日', 4, 29, 1989, 2006],
  [1, '昭和の日', 4, 29, 2007],
  [1, '即位の日', 5, 1, 2019, 2019],
  [1, '憲法記念日', 5, 3, 1949],
  [1, 'みどりの日', 5, 4, 2007],
  [1, 'こどもの日', 5, 5, 1949],
  [1, '皇太子徳仁親王の結婚の儀', 6, 9, 1993, 1993],
  [1, '海の日', 7, 20, 1996, 2002],
  [2, '海の日', 7, [3, 1], 2003, 2019],
  [1, '海の日', 7, 23, 2020, 2020],
  [1, '海の日', 7, 22, 2021, 2021],
  [2, '海の日', 7, [3, 1], 2022],
  [1, '山の日', 8, 11, 2016, 2019],
  [1, '山の日', 8, 10, 2020, 2020],
  [1, '山の日', 8, 8, 2021, 2021],
  [1, '山の日', 8, 11, 2022],
  [1, '敬老の日', 9, 15, 1966, 2002],
  [2, '敬老の日', 9, [3, 1], 2003],
  [4, '秋分の日'],
  [1, '体育の日', 10, 10, 1966, 1999],
  [2, '体育の日', 10, [2, 1], 2000, 2019],
  [1, 'スポーツの日', 7, 24, 2020, 2020],
  [1, 'スポーツの日', 7, 23, 2021, 2021],
  [2, 'スポーツの日', 10, [2, 1], 2022],
  [1, '即位礼正殿の儀', 10, 22, 2019, 2019],
  [1, '文化の日', 11, 3, 1948],
  [1, '即位礼正殿の儀', 11, 12, 1990, 1990],
  [1, '勤労感謝の日', 11, 23, 1948],
  [1, '天皇誕生日', 12, 23, 1989, 2018],
];

export default definitions;
